mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d3xg/common/s6e2d3xg.h
typedef struct stc_gdcsub_dsp_lockstatus_field
{
        __IO  uint32_t  DSP_LOCKSTATUS           :1;
        __IO  uint32_t  RESERVED0                :3;
        __IO  uint32_t  DSP_PRIVILEGESTATUS      :1;
        __IO  uint32_t  RESERVED1                :3;
        __IO  uint32_t  DSP_FREEZESTATUS         :1;
        __IO  uint32_t  RESERVED2                :23;
} stc_gdcsub_dsp_lockstatus_field_t;

typedef struct stc_gdcsub_dsp0_clockdivider_field
{
    union {
        struct {
            __IO  uint32_t  RESERVED0            :8;
            __IO  uint32_t  DSP0_CLOCKDIVIDER    :16;
            __IO  uint32_t  RESERVED2            :8;
        };
        struct {
            __IO  uint32_t  RESERVED1            :8;
            __IO  uint32_t  DSP0_CLOCKDIVIDER0   :1;
            __IO  uint32_t  DSP0_CLOCKDIVIDER1   :1;
            __IO  uint32_t  DSP0_CLOCKDIVIDER2   :1;
            __IO  uint32_t  DSP0_CLOCKDIVIDER3   :1;
            __IO  uint32_t  DSP0_CLOCKDIVIDER4   :1;
            __IO  uint32_t  DSP0_CLOCKDIVIDER5   :1;
            __IO  uint32_t  DSP0_CLOCKDIVIDER6   :1;
            __IO  uint32_t  DSP0_CLOCKDIVIDER7   :1;
            __IO  uint32_t  DSP0_CLOCKDIVIDER8   :1;
            __IO  uint32_t  DSP0_CLOCKDIVIDER9   :1;
            __IO  uint32_t  DSP0_CLOCKDIVIDER10  :1;
            __IO  uint32_t  DSP0_CLOCKDIVIDER11  :1;
            __IO  uint32_t  DSP0_CLOCKDIVIDER12  :1;
            __IO  uint32_t  DSP0_CLOCKDIVIDER13  :1;
            __IO  uint32_t  DSP0_CLOCKDIVIDER14  :1;
            __IO  uint32_t  DSP0_CLOCKDIVIDER15  :1;
            __IO  uint32_t  RESERVED3            :8;
        };
    };
} stc_gdcsub_dsp0_clockdivider_field_t;

typedef struct stc_gdcsub_dsp0_domaincontrol_field
{
        __IO  uint32_t  DSP0_CLOCKENABLE         :1;
        __IO  uint32_t  RESERVED0                :15;
        __IO  uint32_t  DSP0_SOFTWARERESET       :1;
        __IO  uint32_t  RESERVED1                :15;
} stc_gdcsub_dsp0_domaincontrol_field_t;

typedef struct stc_gdcsub_dsp0_clockshift_field
{
    union {
        struct {
            __IO  uint32_t  DSP0_CLOCKINVERT     :1;
            __IO  uint32_t  RESERVED0            :15;
            __IO  uint32_t  DSP0_CLOCKOFFSET     :8;
            __IO  uint32_t  RESERVED2            :8;
        };
        struct {
            __IO  uint32_t  RESERVED1            :16;
            __IO  uint32_t  DSP0_CLOCKOFFSET0    :1;
            __IO  uint32_t  DSP0_CLOCKOFFSET1    :1;
            __IO  uint32_t  DSP0_CLOCKOFFSET2    :1;
            __IO  uint32_t  DSP0_CLOCKOFFSET3    :1;
            __IO  uint32_t  DSP0_CLOCKOFFSET4    :1;
            __IO  uint32_t  DSP0_CLOCKOFFSET5    :1;
            __IO  uint32_t  DSP0_CLOCKOFFSET6    :1;
            __IO  uint32_t  DSP0_CLOCKOFFSET7    :1;
            __IO  uint32_t  RESERVED3            :8;
        };
    };
} stc_gdcsub_dsp0_clockshift_field_t;

typedef struct stc_gdcsub_dsp0_powerencontrol_field
{
        __IO  uint32_t  POWER_ENABLE             :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_gdcsub_dsp0_powerencontrol_field_t;

typedef struct stc_gdcsub_dsp0_clockgatemodelock_field
{
    union {
        struct {
            __IO  uint32_t  LOCKUNLOCK           :32;
        };
        struct {
            __IO  uint32_t  LOCKUNLOCK0          :1;
            __IO  uint32_t  LOCKUNLOCK1          :1;
            __IO  uint32_t  LOCKUNLOCK2          :1;
            __IO  uint32_t  LOCKUNLOCK3          :1;
            __IO  uint32_t  LOCKUNLOCK4          :1;
            __IO  uint32_t  LOCKUNLOCK5          :1;
            __IO  uint32_t  LOCKUNLOCK6          :1;
            __IO  uint32_t  LOCKUNLOCK7          :1;
            __IO  uint32_t  LOCKUNLOCK8          :1;
            __IO  uint32_t  LOCKUNLOCK9          :1;
            __IO  uint32_t  LOCKUNLOCK10         :1;
            __IO  uint32_t  LOCKUNLOCK11         :1;
            __IO  uint32_t  LOCKUNLOCK12         :1;
            __IO  uint32_t  LOCKUNLOCK13         :1;
            __IO  uint32_t  LOCKUNLOCK14         :1;
            __IO  uint32_t  LOCKUNLOCK15         :1;
            __IO  uint32_t  LOCKUNLOCK16         :1;
            __IO  uint32_t  LOCKUNLOCK17         :1;
            __IO  uint32_t  LOCKUNLOCK18         :1;
            __IO  uint32_t  LOCKUNLOCK19         :1;
            __IO  uint32_t  LOCKUNLOCK20         :1;
            __IO  uint32_t  LOCKUNLOCK21         :1;
            __IO  uint32_t  LOCKUNLOCK22         :1;
            __IO  uint32_t  LOCKUNLOCK23         :1;
            __IO  uint32_t  LOCKUNLOCK24         :1;
            __IO  uint32_t  LOCKUNLOCK25         :1;
            __IO  uint32_t  LOCKUNLOCK26         :1;
            __IO  uint32_t  LOCKUNLOCK27         :1;
            __IO  uint32_t  LOCKUNLOCK28         :1;
            __IO  uint32_t  LOCKUNLOCK29         :1;
            __IO  uint32_t  LOCKUNLOCK30         :1;
            __IO  uint32_t  LOCKUNLOCK31         :1;
        };
    };
} stc_gdcsub_dsp0_clockgatemodelock_field_t;

typedef struct stc_gdcsub_dsp0_clockgatecontrol_field
{
        __IO  uint32_t  CLOCKGATE_ENABLE         :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_gdcsub_dsp0_clockgatecontrol_field_t;

typedef struct stc_gdcsub_sdramc_clockdivider_field
{
    union {
        struct {
            __IO  uint32_t  RESERVED0            :8;
            __IO  uint32_t  SDRAMC_CLOCKDIVIDER  :16;
            __IO  uint32_t  RESERVED2            :8;
        };
        struct {
            __IO  uint32_t  RESERVED1            :8;
            __IO  uint32_t  SDRAMC_CLOCKDIVIDER0 :1;
            __IO  uint32_t  SDRAMC_CLOCKDIVIDER1 :1;
            __IO  uint32_t  SDRAMC_CLOCKDIVIDER2 :1;
            __IO  uint32_t  SDRAMC_CLOCKDIVIDER3 :1;
            __IO  uint32_t  SDRAMC_CLOCKDIVIDER4 :1;
            __IO  uint32_t  SDRAMC_CLOCKDIVIDER5 :1;
            __IO  uint32_t  SDRAMC_CLOCKDIVIDER6 :1;
            __IO  uint32_t  SDRAMC_CLOCKDIVIDER7 :1;
            __IO  uint32_t  SDRAMC_CLOCKDIVIDER8 :1;
            __IO  uint32_t  SDRAMC_CLOCKDIVIDER9 :1;
            __IO  uint32_t  SDRAMC_CLOCKDIVIDER10:1;
            __IO  uint32_t  SDRAMC_CLOCKDIVIDER11:1;
            __IO  uint32_t  SDRAMC_CLOCKDIVIDER12:1;
            __IO  uint32_t  SDRAMC_CLOCKDIVIDER13:1;
            __IO  uint32_t  SDRAMC_CLOCKDIVIDER14:1;
            __IO  uint32_t  SDRAMC_CLOCKDIVIDER15:1;
            __IO  uint32_t  RESERVED3            :8;
        };
    };
} stc_gdcsub_sdramc_clockdivider_field_t;

typedef struct stc_gdcsub_sdramc_domaincontrol_field
{
        __IO  uint32_t  SDRAMC_CLOCKENABLE       :1;
        __IO  uint32_t  RESERVED0                :15;
        __IO  uint32_t  SDRAMC_SOFTWARERESET     :1;
        __IO  uint32_t  RESERVED1                :15;
} stc_gdcsub_sdramc_domaincontrol_field_t;

