mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d3xg/common/s6e2d3xg.h
typedef struct stc_gpio_epfr26_field
{
    union {
        struct {
            __IO  uint32_t  Q_SCKB               :2;
            __IO  uint32_t  Q_CS0E               :2;
            __IO  uint32_t  Q_CS1E               :2;
            __IO  uint32_t  Q_CS2E               :2;
            __IO  uint32_t  Q_CS3E               :2;
            __IO  uint32_t  Q_IO0B               :2;
            __IO  uint32_t  Q_IO1B               :2;
            __IO  uint32_t  Q_IO2B               :2;
            __IO  uint32_t  Q_IO3B               :2;
            __IO  uint32_t  RESERVED0            :14;
        };
        struct {
            __IO  uint32_t  Q_SCKB0              :1;
            __IO  uint32_t  Q_SCKB1              :1;
            __IO  uint32_t  Q_CS0E0              :1;
            __IO  uint32_t  Q_CS0E1              :1;
            __IO  uint32_t  Q_CS1E0              :1;
            __IO  uint32_t  Q_CS1E1              :1;
            __IO  uint32_t  Q_CS2E0              :1;
            __IO  uint32_t  Q_CS2E1              :1;
            __IO  uint32_t  Q_CS3E0              :1;
            __IO  uint32_t  Q_CS3E1              :1;
            __IO  uint32_t  Q_IO0B0              :1;
            __IO  uint32_t  Q_IO0B1              :1;
            __IO  uint32_t  Q_IO1B0              :1;
            __IO  uint32_t  Q_IO1B1              :1;
            __IO  uint32_t  Q_IO2B0              :1;
            __IO  uint32_t  Q_IO2B1              :1;
            __IO  uint32_t  Q_IO3B0              :1;
            __IO  uint32_t  Q_IO3B1              :1;
            __IO  uint32_t  RESERVED1            :14;
        };
    };
} stc_gpio_epfr26_field_t;

typedef struct stc_gpio_epfr27_field
{
    union {
        struct {
            __IO  uint32_t  HBCKE                :2;
            __IO  uint32_t  HBCSX_0E             :2;
            __IO  uint32_t  HBCSX_1E             :2;
            __IO  uint32_t  HBRWDSB              :2;
            __IO  uint32_t  HBDQ0B               :2;
            __IO  uint32_t  HBDQ1B               :2;
            __IO  uint32_t  HBDQ2B               :2;
            __IO  uint32_t  HBDQ3B               :2;
            __IO  uint32_t  HBDQ4B               :2;
            __IO  uint32_t  HBDQ5B               :2;
            __IO  uint32_t  HBDQ6B               :2;
            __IO  uint32_t  HBDQ7B               :2;
            __IO  uint32_t  HBWPXE               :2;
            __IO  uint32_t  HBRESETXE            :2;
            __IO  uint32_t  HBRSTOXS             :2;
            __IO  uint32_t  HBINTXS              :2;
        };
        struct {
            __IO  uint32_t  HBCKE0               :1;
            __IO  uint32_t  HBCKE1               :1;
            __IO  uint32_t  HBCSX_0E0            :1;
            __IO  uint32_t  HBCSX_0E1            :1;
            __IO  uint32_t  HBCSX_1E0            :1;
            __IO  uint32_t  HBCSX_1E1            :1;
            __IO  uint32_t  HBRWDSB0             :1;
            __IO  uint32_t  HBRWDSB1             :1;
            __IO  uint32_t  HBDQ0B0              :1;
            __IO  uint32_t  HBDQ0B1              :1;
            __IO  uint32_t  HBDQ1B0              :1;
            __IO  uint32_t  HBDQ1B1              :1;
            __IO  uint32_t  HBDQ2B0              :1;
            __IO  uint32_t  HBDQ2B1              :1;
            __IO  uint32_t  HBDQ3B0              :1;
            __IO  uint32_t  HBDQ3B1              :1;
            __IO  uint32_t  HBDQ4B0              :1;
            __IO  uint32_t  HBDQ4B1              :1;
            __IO  uint32_t  HBDQ5B0              :1;
            __IO  uint32_t  HBDQ5B1              :1;
            __IO  uint32_t  HBDQ6B0              :1;
            __IO  uint32_t  HBDQ6B1              :1;
            __IO  uint32_t  HBDQ7B0              :1;
            __IO  uint32_t  HBDQ7B1              :1;
            __IO  uint32_t  HBWPXE0              :1;
            __IO  uint32_t  HBWPXE1              :1;
            __IO  uint32_t  HBRESETXE0           :1;
            __IO  uint32_t  HBRESETXE1           :1;
            __IO  uint32_t  HBRSTOXS0            :1;
            __IO  uint32_t  HBRSTOXS1            :1;
            __IO  uint32_t  HBINTXS0             :1;
            __IO  uint32_t  HBINTXS1             :1;
        };
    };
} stc_gpio_epfr27_field_t;

typedef struct stc_gpio_epfr28_field
{
    union {
        struct {
            __IO  uint32_t  PNL_PD0E             :2;
            __IO  uint32_t  PNL_PD1E             :2;
            __IO  uint32_t  PNL_PD2E             :2;
            __IO  uint32_t  PNL_PD3E             :2;
            __IO  uint32_t  PNL_PD4E             :2;
            __IO  uint32_t  PNL_PD5E             :2;
            __IO  uint32_t  PNL_PD6E             :2;
            __IO  uint32_t  PNL_PD7E             :2;
            __IO  uint32_t  PNL_PD8E             :2;
            __IO  uint32_t  PNL_PD9E             :2;
            __IO  uint32_t  PNL_PD10E            :2;
            __IO  uint32_t  PNL_PD11E            :2;
            __IO  uint32_t  PNL_PD12E            :2;
            __IO  uint32_t  PNL_PD13E            :2;
            __IO  uint32_t  PNL_PD14E            :2;
            __IO  uint32_t  PNL_PD15E            :2;
        };
        struct {
            __IO  uint32_t  PNL_PD0E0            :1;
            __IO  uint32_t  PNL_PD0E1            :1;
            __IO  uint32_t  PNL_PD1E0            :1;
            __IO  uint32_t  PNL_PD1E1            :1;
            __IO  uint32_t  PNL_PD2E0            :1;
            __IO  uint32_t  PNL_PD2E1            :1;
            __IO  uint32_t  PNL_PD3E0            :1;
            __IO  uint32_t  PNL_PD3E1            :1;
            __IO  uint32_t  PNL_PD4E0            :1;
            __IO  uint32_t  PNL_PD4E1            :1;
            __IO  uint32_t  PNL_PD5E0            :1;
            __IO  uint32_t  PNL_PD5E1            :1;
            __IO  uint32_t  PNL_PD6E0            :1;
            __IO  uint32_t  PNL_PD6E1            :1;
            __IO  uint32_t  PNL_PD7E0            :1;
            __IO  uint32_t  PNL_PD7E1            :1;
            __IO  uint32_t  PNL_PD8E0            :1;
            __IO  uint32_t  PNL_PD8E1            :1;
            __IO  uint32_t  PNL_PD9E0            :1;
            __IO  uint32_t  PNL_PD9E1            :1;
            __IO  uint32_t  PNL_PD10E0           :1;
            __IO  uint32_t  PNL_PD10E1           :1;
            __IO  uint32_t  PNL_PD11E0           :1;
            __IO  uint32_t  PNL_PD11E1           :1;
            __IO  uint32_t  PNL_PD12E0           :1;
            __IO  uint32_t  PNL_PD12E1           :1;
            __IO  uint32_t  PNL_PD13E0           :1;
            __IO  uint32_t  PNL_PD13E1           :1;
            __IO  uint32_t  PNL_PD14E0           :1;
            __IO  uint32_t  PNL_PD14E1           :1;
            __IO  uint32_t  PNL_PD15E0           :1;
            __IO  uint32_t  PNL_PD15E1           :1;
        };
    };
} stc_gpio_epfr28_field_t;

typedef struct stc_gpio_epfr29_field
{
    union {
        struct {
            __IO  uint32_t  PNL_PD16E            :2;
            __IO  uint32_t  PNL_PD17E            :2;
            __IO  uint32_t  PNL_PD18E            :2;
            __IO  uint32_t  PNL_PD19E            :2;
            __IO  uint32_t  PNL_PD20E            :2;
            __IO  uint32_t  PNL_PD21E            :2;
            __IO  uint32_t  PNL_PD22E            :2;
            __IO  uint32_t  PNL_PD23E            :2;
            __IO  uint32_t  RESERVED0            :2;
            __IO  uint32_t  PNL_TSIG5E           :2;
            __IO  uint32_t  PNL_TSIG6E           :2;
            __IO  uint32_t  PNL_TSIG7E           :2;
            __IO  uint32_t  PNL_TSIG8E           :2;
            __IO  uint32_t  PNL_TSIG9E           :2;
            __IO  uint32_t  PNL_TSIG10E          :2;
            __IO  uint32_t  PNL_TSIG11E          :2;
        };
        struct {
            __IO  uint32_t  PNL_PD16E0           :1;
            __IO  uint32_t  PNL_PD16E1           :1;
            __IO  uint32_t  PNL_PD17E0           :1;
            __IO  uint32_t  PNL_PD17E1           :1;
            __IO  uint32_t  PNL_PD18E0           :1;
            __IO  uint32_t  PNL_PD18E1           :1;
            __IO  uint32_t  PNL_PD19E0           :1;
            __IO  uint32_t  PNL_PD19E1           :1;
            __IO  uint32_t  PNL_PD20E0           :1;
            __IO  uint32_t  PNL_PD20E1           :1;
            __IO  uint32_t  PNL_PD21E0           :1;
            __IO  uint32_t  PNL_PD21E1           :1;
            __IO  uint32_t  PNL_PD22E0           :1;
            __IO  uint32_t  PNL_PD22E1           :1;
            __IO  uint32_t  PNL_PD23E0           :1;
            __IO  uint32_t  PNL_PD23E1           :1;
            __IO  uint32_t  RESERVED1            :2;
            __IO  uint32_t  PNL_TSIG5E0          :1;
            __IO  uint32_t  PNL_TSIG5E1          :1;
            __IO  uint32_t  PNL_TSIG6E0          :1;
            __IO  uint32_t  PNL_TSIG6E1          :1;
            __IO  uint32_t  PNL_TSIG7E0          :1;
            __IO  uint32_t  PNL_TSIG7E1          :1;
            __IO  uint32_t  PNL_TSIG8E0          :1;
            __IO  uint32_t  PNL_TSIG8E1          :1;
            __IO  uint32_t  PNL_TSIG9E0          :1;
            __IO  uint32_t  PNL_TSIG9E1          :1;
            __IO  uint32_t  PNL_TSIG10E0         :1;
            __IO  uint32_t  PNL_TSIG10E1         :1;
            __IO  uint32_t  PNL_TSIG11E0         :1;
            __IO  uint32_t  PNL_TSIG11E1         :1;
        };
    };
} stc_gpio_epfr29_field_t;

