mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d3xg/common/s6e2d3xg.h
/*******************************************************************************
* GDCSUB Registers GDCSUB
*   Register Definition
*******************************************************************************/
#define FM_GDCSUB_LOCKUNLOCK                      *((volatile uint32_t*)(0xD0A00000UL))
#define FM4_GDCSUB_LOCKUNLOCK                     *((volatile uint32_t*)(0xD0A00000UL))
#define FM_GDCSUB_LOCKSTATUS                      *((volatile uint32_t*)(0xD0A00004UL))
#define FM4_GDCSUB_LOCKSTATUS                     *((volatile uint32_t*)(0xD0A00004UL))
#define FM_GDCSUB_CONFIGCLOCKCONTROL              *((volatile uint32_t*)(0xD0A0000CUL))
#define FM4_GDCSUB_CONFIGCLOCKCONTROL             *((volatile uint32_t*)(0xD0A0000CUL))
#define FM_GDCSUB_VRAMINTERRUPTENABLE             *((volatile uint32_t*)(0xD0A00010UL))
#define FM4_GDCSUB_VRAMINTERRUPTENABLE            *((volatile uint32_t*)(0xD0A00010UL))
#define FM_GDCSUB_VRAMINTERRUPTCLEAR              *((volatile uint32_t*)(0xD0A00018UL))
#define FM4_GDCSUB_VRAMINTERRUPTCLEAR             *((volatile uint32_t*)(0xD0A00018UL))
#define FM_GDCSUB_VRAMINTERRUPTSTATUS             *((volatile uint32_t*)(0xD0A0001CUL))
#define FM4_GDCSUB_VRAMINTERRUPTSTATUS            *((volatile uint32_t*)(0xD0A0001CUL))
#define FM_GDCSUB_EXTFLASHDEVSELECT               *((volatile uint32_t*)(0xD0A00020UL))
#define FM4_GDCSUB_EXTFLASHDEVSELECT              *((volatile uint32_t*)(0xD0A00020UL))
#define FM_GDCSUB_VRAMREMAPDISABLE                *((volatile uint32_t*)(0xD0A00024UL))
#define FM4_GDCSUB_VRAMREMAPDISABLE               *((volatile uint32_t*)(0xD0A00024UL))
#define FM_GDCSUB_PANICSWITCH                     *((volatile uint32_t*)(0xD0A00028UL))
#define FM4_GDCSUB_PANICSWITCH                    *((volatile uint32_t*)(0xD0A00028UL))
#define FM_GDCSUB_GDC_CLOCKDIVIDER                *((volatile uint32_t*)(0xD0A0002CUL))
#define FM4_GDCSUB_GDC_CLOCKDIVIDER               *((volatile uint32_t*)(0xD0A0002CUL))
#define FM_GDCSUB_WKUPTRIGGERMASK                 *((volatile uint32_t*)(0xD0A00030UL))
#define FM4_GDCSUB_WKUPTRIGGERMASK                *((volatile uint32_t*)(0xD0A00030UL))
#define FM_GDCSUB_CLOCKDOMAINSTATUS               *((volatile uint32_t*)(0xD0A00034UL))
#define FM4_GDCSUB_CLOCKDOMAINSTATUS              *((volatile uint32_t*)(0xD0A00034UL))
#define FM_GDCSUB_DSP_LOCKUNLOCK                  *((volatile uint32_t*)(0xD0A00040UL))
#define FM4_GDCSUB_DSP_LOCKUNLOCK                 *((volatile uint32_t*)(0xD0A00040UL))
#define FM_GDCSUB_DSP_LOCKSTATUS                  *((volatile uint32_t*)(0xD0A00044UL))
#define FM4_GDCSUB_DSP_LOCKSTATUS                 *((volatile uint32_t*)(0xD0A00044UL))
#define FM_GDCSUB_DSP0_CLOCKDIVIDER               *((volatile uint32_t*)(0xD0A00048UL))
#define FM4_GDCSUB_DSP0_CLOCKDIVIDER              *((volatile uint32_t*)(0xD0A00048UL))
#define FM_GDCSUB_DSP0_DOMAINCONTROL              *((volatile uint32_t*)(0xD0A0004CUL))
#define FM4_GDCSUB_DSP0_DOMAINCONTROL             *((volatile uint32_t*)(0xD0A0004CUL))
#define FM_GDCSUB_DSP0_CLOCKSHIFT                 *((volatile uint32_t*)(0xD0A00050UL))
#define FM4_GDCSUB_DSP0_CLOCKSHIFT                *((volatile uint32_t*)(0xD0A00050UL))
#define FM_GDCSUB_DSP0_POWERENCONTROL             *((volatile uint32_t*)(0xD0A00058UL))
#define FM4_GDCSUB_DSP0_POWERENCONTROL            *((volatile uint32_t*)(0xD0A00058UL))
#define FM_GDCSUB_DSP0_CLOCKGATEMODELOCK          *((volatile uint32_t*)(0xD0A0005CUL))
#define FM4_GDCSUB_DSP0_CLOCKGATEMODELOCK         *((volatile uint32_t*)(0xD0A0005CUL))
#define FM_GDCSUB_DSP0_CLOCKGATECONTROL           *((volatile uint32_t*)(0xD0A00060UL))
#define FM4_GDCSUB_DSP0_CLOCKGATECONTROL          *((volatile uint32_t*)(0xD0A00060UL))
#define FM_GDCSUB_SDRAMC_CLOCKDIVIDER             *((volatile uint32_t*)(0xD0A00078UL))
#define FM4_GDCSUB_SDRAMC_CLOCKDIVIDER            *((volatile uint32_t*)(0xD0A00078UL))
#define FM_GDCSUB_SDRAMC_DOMAINCONTROL            *((volatile uint32_t*)(0xD0A0007CUL))
#define FM4_GDCSUB_SDRAMC_DOMAINCONTROL           *((volatile uint32_t*)(0xD0A0007CUL))
#define FM_GDCSUB_HSSPIC_CLOCKDIVIDER             *((volatile uint32_t*)(0xD0A00080UL))
#define FM4_GDCSUB_HSSPIC_CLOCKDIVIDER            *((volatile uint32_t*)(0xD0A00080UL))
#define FM_GDCSUB_HSSPIC_DOMAINCONTROL            *((volatile uint32_t*)(0xD0A00084UL))
#define FM4_GDCSUB_HSSPIC_DOMAINCONTROL           *((volatile uint32_t*)(0xD0A00084UL))
#define FM_GDCSUB_RPCC_CLOCKDIVIDER               *((volatile uint32_t*)(0xD0A00088UL))
#define FM4_GDCSUB_RPCC_CLOCKDIVIDER              *((volatile uint32_t*)(0xD0A00088UL))
#define FM_GDCSUB_RPCC_DOMAINCONTROL              *((volatile uint32_t*)(0xD0A0008CUL))
#define FM4_GDCSUB_RPCC_DOMAINCONTROL             *((volatile uint32_t*)(0xD0A0008CUL))
#define FM_GDCSUB_VRAM_LOCKUNLOCK                 *((volatile uint32_t*)(0xD0A00100UL))
#define FM4_GDCSUB_VRAM_LOCKUNLOCK                *((volatile uint32_t*)(0xD0A00100UL))
#define FM_GDCSUB_VRAM_LOCKSTATUS                 *((volatile uint32_t*)(0xD0A00104UL))
#define FM4_GDCSUB_VRAM_LOCKSTATUS                *((volatile uint32_t*)(0xD0A00104UL))
#define FM_GDCSUB_VRAM_SRAM_SELECT                *((volatile uint32_t*)(0xD0A00108UL))
#define FM4_GDCSUB_VRAM_SRAM_SELECT               *((volatile uint32_t*)(0xD0A00108UL))
#define FM_GDCSUB_VRAM_SBERRADDR_S0               *((volatile uint32_t*)(0xD0A0013CUL))
#define FM4_GDCSUB_VRAM_SBERRADDR_S0              *((volatile uint32_t*)(0xD0A0013CUL))
#define FM_GDCSUB_VRAM_SBERRADDR_S1               *((volatile uint32_t*)(0xD0A00140UL))
#define FM4_GDCSUB_VRAM_SBERRADDR_S1              *((volatile uint32_t*)(0xD0A00140UL))
#define FM_GDCSUB_VRAM_ARBITER_PRIORITY           *((volatile uint32_t*)(0xD0A00148UL))
#define FM4_GDCSUB_VRAM_ARBITER_PRIORITY          *((volatile uint32_t*)(0xD0A00148UL))

/*******************************************************************************
* GPIO Registers GPIO
*   Register Definition
*******************************************************************************/
#define FM_GPIO_PFR0                              *((volatile uint32_t*)(0x4006F000UL))
#define FM4_GPIO_PFR0                             *((volatile uint32_t*)(0x4006F000UL))
#define FM_GPIO_PFR1                              *((volatile uint32_t*)(0x4006F004UL))
#define FM4_GPIO_PFR1                             *((volatile uint32_t*)(0x4006F004UL))
#define FM_GPIO_PFR2                              *((volatile uint32_t*)(0x4006F008UL))
#define FM4_GPIO_PFR2                             *((volatile uint32_t*)(0x4006F008UL))
#define FM_GPIO_PFR3                              *((volatile uint32_t*)(0x4006F00CUL))
#define FM4_GPIO_PFR3                             *((volatile uint32_t*)(0x4006F00CUL))
#define FM_GPIO_PFR4                              *((volatile uint32_t*)(0x4006F010UL))
#define FM4_GPIO_PFR4                             *((volatile uint32_t*)(0x4006F010UL))
#define FM_GPIO_PFR5                              *((volatile uint32_t*)(0x4006F014UL))
#define FM4_GPIO_PFR5                             *((volatile uint32_t*)(0x4006F014UL))
#define FM_GPIO_PFR6                              *((volatile uint32_t*)(0x4006F018UL))
#define FM4_GPIO_PFR6                             *((volatile uint32_t*)(0x4006F018UL))
#define FM_GPIO_PFR7                              *((volatile uint32_t*)(0x4006F01CUL))
#define FM4_GPIO_PFR7                             *((volatile uint32_t*)(0x4006F01CUL))
#define FM_GPIO_PFR8                              *((volatile uint32_t*)(0x4006F020UL))
#define FM4_GPIO_PFR8                             *((volatile uint32_t*)(0x4006F020UL))
#define FM_GPIO_PFR9                              *((volatile uint32_t*)(0x4006F024UL))
#define FM4_GPIO_PFR9                             *((volatile uint32_t*)(0x4006F024UL))
#define FM_GPIO_PFRA                              *((volatile uint32_t*)(0x4006F028UL))
#define FM4_GPIO_PFRA                             *((volatile uint32_t*)(0x4006F028UL))
#define FM_GPIO_PFRB                              *((volatile uint32_t*)(0x4006F02CUL))
#define FM4_GPIO_PFRB                             *((volatile uint32_t*)(0x4006F02CUL))
#define FM_GPIO_PFRC                              *((volatile uint32_t*)(0x4006F030UL))
#define FM4_GPIO_PFRC                             *((volatile uint32_t*)(0x4006F030UL))
#define FM_GPIO_PFRD                              *((volatile uint32_t*)(0x4006F034UL))
#define FM4_GPIO_PFRD                             *((volatile uint32_t*)(0x4006F034UL))
#define FM_GPIO_PFRE                              *((volatile uint32_t*)(0x4006F038UL))
#define FM4_GPIO_PFRE                             *((volatile uint32_t*)(0x4006F038UL))
#define FM_GPIO_PFRF                              *((volatile uint32_t*)(0x4006F03CUL))
#define FM4_GPIO_PFRF                             *((volatile uint32_t*)(0x4006F03CUL))
#define FM_GPIO_PCR0                              *((volatile uint32_t*)(0x4006F100UL))
#define FM4_GPIO_PCR0                             *((volatile uint32_t*)(0x4006F100UL))
#define FM_GPIO_PCR1                              *((volatile uint32_t*)(0x4006F104UL))
#define FM4_GPIO_PCR1                             *((volatile uint32_t*)(0x4006F104UL))
#define FM_GPIO_PCR2                              *((volatile uint32_t*)(0x4006F108UL))
#define FM4_GPIO_PCR2                             *((volatile uint32_t*)(0x4006F108UL))
#define FM_GPIO_PCR3                              *((volatile uint32_t*)(0x4006F10CUL))
#define FM4_GPIO_PCR3                             *((volatile uint32_t*)(0x4006F10CUL))
#define FM_GPIO_PCR4                              *((volatile uint32_t*)(0x4006F110UL))
#define FM4_GPIO_PCR4                             *((volatile uint32_t*)(0x4006F110UL))
#define FM_GPIO_PCR5                              *((volatile uint32_t*)(0x4006F114UL))
#define FM4_GPIO_PCR5                             *((volatile uint32_t*)(0x4006F114UL))
#define FM_GPIO_PCR6                              *((volatile uint32_t*)(0x4006F118UL))
#define FM4_GPIO_PCR6                             *((volatile uint32_t*)(0x4006F118UL))
#define FM_GPIO_PCR7                              *((volatile uint32_t*)(0x4006F11CUL))
#define FM4_GPIO_PCR7                             *((volatile uint32_t*)(0x4006F11CUL))
#define FM_GPIO_PCR9                              *((volatile uint32_t*)(0x4006F124UL))
#define FM4_GPIO_PCR9                             *((volatile uint32_t*)(0x4006F124UL))
#define FM_GPIO_PCRA                              *((volatile uint32_t*)(0x4006F128UL))
#define FM4_GPIO_PCRA                             *((volatile uint32_t*)(0x4006F128UL))
#define FM_GPIO_PCRB                              *((volatile uint32_t*)(0x4006F12CUL))
#define FM4_GPIO_PCRB                             *((volatile uint32_t*)(0x4006F12CUL))
#define FM_GPIO_PCRC                              *((volatile uint32_t*)(0x4006F130UL))
#define FM4_GPIO_PCRC                             *((volatile uint32_t*)(0x4006F130UL))
#define FM_GPIO_PCRD                              *((volatile uint32_t*)(0x4006F134UL))
#define FM4_GPIO_PCRD                             *((volatile uint32_t*)(0x4006F134UL))
#define FM_GPIO_PCRE                              *((volatile uint32_t*)(0x4006F138UL))
#define FM4_GPIO_PCRE                             *((volatile uint32_t*)(0x4006F138UL))
#define FM_GPIO_PCRF                              *((volatile uint32_t*)(0x4006F13CUL))
#define FM4_GPIO_PCRF                             *((volatile uint32_t*)(0x4006F13CUL))
#define FM_GPIO_DDR0                              *((volatile uint32_t*)(0x4006F200UL))
#define FM4_GPIO_DDR0                             *((volatile uint32_t*)(0x4006F200UL))
#define FM_GPIO_DDR1                              *((volatile uint32_t*)(0x4006F204UL))
#define FM4_GPIO_DDR1                             *((volatile uint32_t*)(0x4006F204UL))
#define FM_GPIO_DDR2                              *((volatile uint32_t*)(0x4006F208UL))
#define FM4_GPIO_DDR2                             *((volatile uint32_t*)(0x4006F208UL))
#define FM_GPIO_DDR3                              *((volatile uint32_t*)(0x4006F20CUL))
#define FM4_GPIO_DDR3                             *((volatile uint32_t*)(0x4006F20CUL))
#define FM_GPIO_DDR4                              *((volatile uint32_t*)(0x4006F210UL))
#define FM4_GPIO_DDR4                             *((volatile uint32_t*)(0x4006F210UL))
#define FM_GPIO_DDR5                              *((volatile uint32_t*)(0x4006F214UL))
#define FM4_GPIO_DDR5                             *((volatile uint32_t*)(0x4006F214UL))
#define FM_GPIO_DDR6                              *((volatile uint32_t*)(0x4006F218UL))
#define FM4_GPIO_DDR6                             *((volatile uint32_t*)(0x4006F218UL))
#define FM_GPIO_DDR7                              *((volatile uint32_t*)(0x4006F21CUL))
#define FM4_GPIO_DDR7                             *((volatile uint32_t*)(0x4006F21CUL))
#define FM_GPIO_DDR8                              *((volatile uint32_t*)(0x4006F220UL))
#define FM4_GPIO_DDR8                             *((volatile uint32_t*)(0x4006F220UL))
#define FM_GPIO_DDR9                              *((volatile uint32_t*)(0x4006F224UL))
#define FM4_GPIO_DDR9                             *((volatile uint32_t*)(0x4006F224UL))
#define FM_GPIO_DDRA                              *((volatile uint32_t*)(0x4006F228UL))
#define FM4_GPIO_DDRA                             *((volatile uint32_t*)(0x4006F228UL))
#define FM_GPIO_DDRB                              *((volatile uint32_t*)(0x4006F22CUL))
#define FM4_GPIO_DDRB                             *((volatile uint32_t*)(0x4006F22CUL))
#define FM_GPIO_DDRC                              *((volatile uint32_t*)(0x4006F230UL))
#define FM4_GPIO_DDRC                             *((volatile uint32_t*)(0x4006F230UL))
#define FM_GPIO_DDRD                              *((volatile uint32_t*)(0x4006F234UL))
#define FM4_GPIO_DDRD                             *((volatile uint32_t*)(0x4006F234UL))
#define FM_GPIO_DDRE                              *((volatile uint32_t*)(0x4006F238UL))
#define FM4_GPIO_DDRE                             *((volatile uint32_t*)(0x4006F238UL))
#define FM_GPIO_DDRF                              *((volatile uint32_t*)(0x4006F23CUL))
#define FM4_GPIO_DDRF                             *((volatile uint32_t*)(0x4006F23CUL))
#define FM_GPIO_PDIR0                             *((volatile uint32_t*)(0x4006F300UL))
#define FM4_GPIO_PDIR0                            *((volatile uint32_t*)(0x4006F300UL))
#define FM_GPIO_PDIR1                             *((volatile uint32_t*)(0x4006F304UL))
#define FM4_GPIO_PDIR1                            *((volatile uint32_t*)(0x4006F304UL))
#define FM_GPIO_PDIR2                             *((volatile uint32_t*)(0x4006F308UL))
#define FM4_GPIO_PDIR2                            *((volatile uint32_t*)(0x4006F308UL))
#define FM_GPIO_PDIR3                             *((volatile uint32_t*)(0x4006F30CUL))
#define FM4_GPIO_PDIR3                            *((volatile uint32_t*)(0x4006F30CUL))
#define FM_GPIO_PDIR4                             *((volatile uint32_t*)(0x4006F310UL))
#define FM4_GPIO_PDIR4                            *((volatile uint32_t*)(0x4006F310UL))
#define FM_GPIO_PDIR5                             *((volatile uint32_t*)(0x4006F314UL))
#define FM4_GPIO_PDIR5                            *((volatile uint32_t*)(0x4006F314UL))
#define FM_GPIO_PDIR6                             *((volatile uint32_t*)(0x4006F318UL))
#define FM4_GPIO_PDIR6                            *((volatile uint32_t*)(0x4006F318UL))
#define FM_GPIO_PDIR7                             *((volatile uint32_t*)(0x4006F31CUL))
#define FM4_GPIO_PDIR7                            *((volatile uint32_t*)(0x4006F31CUL))
#define FM_GPIO_PDIR8                             *((volatile uint32_t*)(0x4006F320UL))
#define FM4_GPIO_PDIR8                            *((volatile uint32_t*)(0x4006F320UL))
#define FM_GPIO_PDIR9                             *((volatile uint32_t*)(0x4006F324UL))
#define FM4_GPIO_PDIR9                            *((volatile uint32_t*)(0x4006F324UL))
#define FM_GPIO_PDIRA                             *((volatile uint32_t*)(0x4006F328UL))
#define FM4_GPIO_PDIRA                            *((volatile uint32_t*)(0x4006F328UL))
#define FM_GPIO_PDIRB                             *((volatile uint32_t*)(0x4006F32CUL))
#define FM4_GPIO_PDIRB                            *((volatile uint32_t*)(0x4006F32CUL))
#define FM_GPIO_PDIRC                             *((volatile uint32_t*)(0x4006F330UL))
#define FM4_GPIO_PDIRC                            *((volatile uint32_t*)(0x4006F330UL))
#define FM_GPIO_PDIRD                             *((volatile uint32_t*)(0x4006F334UL))
#define FM4_GPIO_PDIRD                            *((volatile uint32_t*)(0x4006F334UL))
#define FM_GPIO_PDIRE                             *((volatile uint32_t*)(0x4006F338UL))
#define FM4_GPIO_PDIRE                            *((volatile uint32_t*)(0x4006F338UL))
#define FM_GPIO_PDIRF                             *((volatile uint32_t*)(0x4006F33CUL))
#define FM4_GPIO_PDIRF                            *((volatile uint32_t*)(0x4006F33CUL))
#define FM_GPIO_PDOR0                             *((volatile uint32_t*)(0x4006F400UL))
#define FM4_GPIO_PDOR0                            *((volatile uint32_t*)(0x4006F400UL))
#define FM_GPIO_PDOR1                             *((volatile uint32_t*)(0x4006F404UL))
#define FM4_GPIO_PDOR1                            *((volatile uint32_t*)(0x4006F404UL))
#define FM_GPIO_PDOR2                             *((volatile uint32_t*)(0x4006F408UL))
#define FM4_GPIO_PDOR2                            *((volatile uint32_t*)(0x4006F408UL))
#define FM_GPIO_PDOR3                             *((volatile uint32_t*)(0x4006F40CUL))
#define FM4_GPIO_PDOR3                            *((volatile uint32_t*)(0x4006F40CUL))
#define FM_GPIO_PDOR4                             *((volatile uint32_t*)(0x4006F410UL))
#define FM4_GPIO_PDOR4                            *((volatile uint32_t*)(0x4006F410UL))
#define FM_GPIO_PDOR5                             *((volatile uint32_t*)(0x4006F414UL))
#define FM4_GPIO_PDOR5                            *((volatile uint32_t*)(0x4006F414UL))
#define FM_GPIO_PDOR6                             *((volatile uint32_t*)(0x4006F418UL))
#define FM4_GPIO_PDOR6                            *((volatile uint32_t*)(0x4006F418UL))
#define FM_GPIO_PDOR7                             *((volatile uint32_t*)(0x4006F41CUL))
#define FM4_GPIO_PDOR7                            *((volatile uint32_t*)(0x4006F41CUL))
#define FM_GPIO_PDOR8                             *((volatile uint32_t*)(0x4006F420UL))
#define FM4_GPIO_PDOR8                            *((volatile uint32_t*)(0x4006F420UL))
#define FM_GPIO_PDOR9                             *((volatile uint32_t*)(0x4006F424UL))
#define FM4_GPIO_PDOR9                            *((volatile uint32_t*)(0x4006F424UL))
#define FM_GPIO_PDORA                             *((volatile uint32_t*)(0x4006F428UL))
#define FM4_GPIO_PDORA                            *((volatile uint32_t*)(0x4006F428UL))
#define FM_GPIO_PDORB                             *((volatile uint32_t*)(0x4006F42CUL))
#define FM4_GPIO_PDORB                            *((volatile uint32_t*)(0x4006F42CUL))
#define FM_GPIO_PDORC                             *((volatile uint32_t*)(0x4006F430UL))
#define FM4_GPIO_PDORC                            *((volatile uint32_t*)(0x4006F430UL))
#define FM_GPIO_PDORD                             *((volatile uint32_t*)(0x4006F434UL))
#define FM4_GPIO_PDORD                            *((volatile uint32_t*)(0x4006F434UL))
#define FM_GPIO_PDORE                             *((volatile uint32_t*)(0x4006F438UL))
#define FM4_GPIO_PDORE                            *((volatile uint32_t*)(0x4006F438UL))
#define FM_GPIO_PDORF                             *((volatile uint32_t*)(0x4006F43CUL))
#define FM4_GPIO_PDORF                            *((volatile uint32_t*)(0x4006F43CUL))
#define FM_GPIO_ADE                               *((volatile uint32_t*)(0x4006F500UL))
#define FM4_GPIO_ADE                              *((volatile uint32_t*)(0x4006F500UL))
#define FM_GPIO_SPSR                              *((volatile uint32_t*)(0x4006F580UL))
#define FM4_GPIO_SPSR                             *((volatile uint32_t*)(0x4006F580UL))
#define FM_GPIO_EPFR00                            *((volatile uint32_t*)(0x4006F600UL))
#define FM4_GPIO_EPFR00                           *((volatile uint32_t*)(0x4006F600UL))
#define FM_GPIO_EPFR01                            *((volatile uint32_t*)(0x4006F604UL))
#define FM4_GPIO_EPFR01                           *((volatile uint32_t*)(0x4006F604UL))
#define FM_GPIO_EPFR02                            *((volatile uint32_t*)(0x4006F608UL))
#define FM4_GPIO_EPFR02                           *((volatile uint32_t*)(0x4006F608UL))
#define FM_GPIO_EPFR03                            *((volatile uint32_t*)(0x4006F60CUL))
#define FM4_GPIO_EPFR03                           *((volatile uint32_t*)(0x4006F60CUL))
#define FM_GPIO_EPFR04                            *((volatile uint32_t*)(0x4006F610UL))
#define FM4_GPIO_EPFR04                           *((volatile uint32_t*)(0x4006F610UL))
#define FM_GPIO_EPFR05                            *((volatile uint32_t*)(0x4006F614UL))
#define FM4_GPIO_EPFR05                           *((volatile uint32_t*)(0x4006F614UL))
#define FM_GPIO_EPFR06                            *((volatile uint32_t*)(0x4006F618UL))
#define FM4_GPIO_EPFR06                           *((volatile uint32_t*)(0x4006F618UL))
#define FM_GPIO_EPFR07                            *((volatile uint32_t*)(0x4006F61CUL))
#define FM4_GPIO_EPFR07                           *((volatile uint32_t*)(0x4006F61CUL))
#define FM_GPIO_EPFR08                            *((volatile uint32_t*)(0x4006F620UL))
#define FM4_GPIO_EPFR08                           *((volatile uint32_t*)(0x4006F620UL))
#define FM_GPIO_EPFR09                            *((volatile uint32_t*)(0x4006F624UL))
#define FM4_GPIO_EPFR09                           *((volatile uint32_t*)(0x4006F624UL))
#define FM_GPIO_EPFR10                            *((volatile uint32_t*)(0x4006F628UL))
#define FM4_GPIO_EPFR10                           *((volatile uint32_t*)(0x4006F628UL))
#define FM_GPIO_EPFR11                            *((volatile uint32_t*)(0x4006F62CUL))
#define FM4_GPIO_EPFR11                           *((volatile uint32_t*)(0x4006F62CUL))
#define FM_GPIO_EPFR12                            *((volatile uint32_t*)(0x4006F630UL))
#define FM4_GPIO_EPFR12                           *((volatile uint32_t*)(0x4006F630UL))
#define FM_GPIO_EPFR13                            *((volatile uint32_t*)(0x4006F634UL))
#define FM4_GPIO_EPFR13                           *((volatile uint32_t*)(0x4006F634UL))
#define FM_GPIO_EPFR14                            *((volatile uint32_t*)(0x4006F638UL))
#define FM4_GPIO_EPFR14                           *((volatile uint32_t*)(0x4006F638UL))
#define FM_GPIO_EPFR15                            *((volatile uint32_t*)(0x4006F63CUL))
#define FM4_GPIO_EPFR15                           *((volatile uint32_t*)(0x4006F63CUL))
#define FM_GPIO_EPFR16                            *((volatile uint32_t*)(0x4006F640UL))
#define FM4_GPIO_EPFR16                           *((volatile uint32_t*)(0x4006F640UL))
#define FM_GPIO_EPFR17                            *((volatile uint32_t*)(0x4006F644UL))
#define FM4_GPIO_EPFR17                           *((volatile uint32_t*)(0x4006F644UL))
#define FM_GPIO_EPFR18                            *((volatile uint32_t*)(0x4006F648UL))
#define FM4_GPIO_EPFR18                           *((volatile uint32_t*)(0x4006F648UL))
