mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d3xg/common/s6e2d3xg.h
/*******************************************************************************
* HWWDT Registers HWWDT
*   Register Definition
*******************************************************************************/
#define FM_HWWDT_WDG_LDR                          *((volatile uint32_t*)(0x40011000UL))
#define FM4_HWWDT_WDG_LDR                         *((volatile uint32_t*)(0x40011000UL))
#define FM_HWWDT_WDG_VLR                          *((volatile uint32_t*)(0x40011004UL))
#define FM4_HWWDT_WDG_VLR                         *((volatile uint32_t*)(0x40011004UL))
#define FM_HWWDT_WDG_CTL                          *((volatile uint32_t*)(0x40011008UL))
#define FM4_HWWDT_WDG_CTL                         *((volatile uint32_t*)(0x40011008UL))
#define FM_HWWDT_WDG_ICL                          *((volatile uint32_t*)(0x4001100CUL))
#define FM4_HWWDT_WDG_ICL                         *((volatile uint32_t*)(0x4001100CUL))
#define FM_HWWDT_WDG_RIS                          *((volatile uint32_t*)(0x40011010UL))
#define FM4_HWWDT_WDG_RIS                         *((volatile uint32_t*)(0x40011010UL))
#define FM_HWWDT_WDG_LCK                          *((volatile uint32_t*)(0x40011C00UL))
#define FM4_HWWDT_WDG_LCK                         *((volatile uint32_t*)(0x40011C00UL))

/*******************************************************************************
* HYPERBUS Registers HYPERBUS
*   Register Definition
*******************************************************************************/
#define FM_HYPERBUS_CSR                           *((volatile uint32_t*)(0xD0A05000UL))
#define FM4_HYPERBUS_CSR                          *((volatile uint32_t*)(0xD0A05000UL))
#define FM_HYPERBUS_IEN                           *((volatile uint32_t*)(0xD0A05004UL))
#define FM4_HYPERBUS_IEN                          *((volatile uint32_t*)(0xD0A05004UL))
#define FM_HYPERBUS_ISR                           *((volatile uint32_t*)(0xD0A05008UL))
#define FM4_HYPERBUS_ISR                          *((volatile uint32_t*)(0xD0A05008UL))
#define FM_HYPERBUS_MBR0                          *((volatile uint32_t*)(0xD0A05010UL))
#define FM4_HYPERBUS_MBR0                         *((volatile uint32_t*)(0xD0A05010UL))
#define FM_HYPERBUS_MBR1                          *((volatile uint32_t*)(0xD0A05014UL))
#define FM4_HYPERBUS_MBR1                         *((volatile uint32_t*)(0xD0A05014UL))
#define FM_HYPERBUS_MCR0                          *((volatile uint32_t*)(0xD0A05020UL))
#define FM4_HYPERBUS_MCR0                         *((volatile uint32_t*)(0xD0A05020UL))
#define FM_HYPERBUS_MCR1                          *((volatile uint32_t*)(0xD0A05024UL))
#define FM4_HYPERBUS_MCR1                         *((volatile uint32_t*)(0xD0A05024UL))
#define FM_HYPERBUS_MTR0                          *((volatile uint32_t*)(0xD0A05030UL))
#define FM4_HYPERBUS_MTR0                         *((volatile uint32_t*)(0xD0A05030UL))
#define FM_HYPERBUS_MTR1                          *((volatile uint32_t*)(0xD0A05034UL))
#define FM4_HYPERBUS_MTR1                         *((volatile uint32_t*)(0xD0A05034UL))
#define FM_HYPERBUS_GPOR                          *((volatile uint32_t*)(0xD0A05040UL))
#define FM4_HYPERBUS_GPOR                         *((volatile uint32_t*)(0xD0A05040UL))
#define FM_HYPERBUS_WPR                           *((volatile uint32_t*)(0xD0A05044UL))
#define FM4_HYPERBUS_WPR                          *((volatile uint32_t*)(0xD0A05044UL))
#define FM_HYPERBUS_TEST                          *((volatile uint32_t*)(0xD0A05048UL))
#define FM4_HYPERBUS_TEST                         *((volatile uint32_t*)(0xD0A05048UL))

/*******************************************************************************
* I2S Registers I2S0
*   Register Definition
*******************************************************************************/
#define FM_I2S0_RXFDAT                            *((volatile uint32_t*)(0x4006C000UL))
#define FM4_I2S0_RXFDAT                           *((volatile uint32_t*)(0x4006C000UL))
#define FM_I2S0_TXFDAT                            *((volatile uint32_t*)(0x4006C004UL))
#define FM4_I2S0_TXFDAT                           *((volatile uint32_t*)(0x4006C004UL))
#define FM_I2S0_CNTREG                            *((volatile uint32_t*)(0x4006C008UL))
#define FM4_I2S0_CNTREG                           *((volatile uint32_t*)(0x4006C008UL))
#define FM_I2S0_MCR0REG                           *((volatile uint32_t*)(0x4006C00CUL))
#define FM4_I2S0_MCR0REG                          *((volatile uint32_t*)(0x4006C00CUL))
#define FM_I2S0_MCR1REG                           *((volatile uint32_t*)(0x4006C010UL))
#define FM4_I2S0_MCR1REG                          *((volatile uint32_t*)(0x4006C010UL))
#define FM_I2S0_MCR2REG                           *((volatile uint32_t*)(0x4006C014UL))
#define FM4_I2S0_MCR2REG                          *((volatile uint32_t*)(0x4006C014UL))
#define FM_I2S0_OPRREG                            *((volatile uint32_t*)(0x4006C018UL))
#define FM4_I2S0_OPRREG                           *((volatile uint32_t*)(0x4006C018UL))
#define FM_I2S0_SRST                              *((volatile uint32_t*)(0x4006C01CUL))
#define FM4_I2S0_SRST                             *((volatile uint32_t*)(0x4006C01CUL))
#define FM_I2S0_INTCNT                            *((volatile uint32_t*)(0x4006C020UL))
#define FM4_I2S0_INTCNT                           *((volatile uint32_t*)(0x4006C020UL))
#define FM_I2S0_STATUS                            *((volatile uint32_t*)(0x4006C024UL))
#define FM4_I2S0_STATUS                           *((volatile uint32_t*)(0x4006C024UL))
#define FM_I2S0_DMAACT                            *((volatile uint32_t*)(0x4006C028UL))
#define FM4_I2S0_DMAACT                           *((volatile uint32_t*)(0x4006C028UL))
#define FM_I2S0_TSTREG                            *((volatile uint32_t*)(0x4006C02CUL))
#define FM4_I2S0_TSTREG                           *((volatile uint32_t*)(0x4006C02CUL))

/*******************************************************************************
* I2S Registers I2S1
*   Register Definition
*******************************************************************************/
#define FM_I2S1_RXFDAT                            *((volatile uint32_t*)(0x4006C800UL))
#define FM4_I2S1_RXFDAT                           *((volatile uint32_t*)(0x4006C800UL))
#define FM_I2S1_TXFDAT                            *((volatile uint32_t*)(0x4006C804UL))
#define FM4_I2S1_TXFDAT                           *((volatile uint32_t*)(0x4006C804UL))
#define FM_I2S1_CNTREG                            *((volatile uint32_t*)(0x4006C808UL))
#define FM4_I2S1_CNTREG                           *((volatile uint32_t*)(0x4006C808UL))
#define FM_I2S1_MCR0REG                           *((volatile uint32_t*)(0x4006C80CUL))
#define FM4_I2S1_MCR0REG                          *((volatile uint32_t*)(0x4006C80CUL))
#define FM_I2S1_MCR1REG                           *((volatile uint32_t*)(0x4006C810UL))
#define FM4_I2S1_MCR1REG                          *((volatile uint32_t*)(0x4006C810UL))
#define FM_I2S1_MCR2REG                           *((volatile uint32_t*)(0x4006C814UL))
#define FM4_I2S1_MCR2REG                          *((volatile uint32_t*)(0x4006C814UL))
#define FM_I2S1_OPRREG                            *((volatile uint32_t*)(0x4006C818UL))
#define FM4_I2S1_OPRREG                           *((volatile uint32_t*)(0x4006C818UL))
#define FM_I2S1_SRST                              *((volatile uint32_t*)(0x4006C81CUL))
#define FM4_I2S1_SRST                             *((volatile uint32_t*)(0x4006C81CUL))
#define FM_I2S1_INTCNT                            *((volatile uint32_t*)(0x4006C820UL))
#define FM4_I2S1_INTCNT                           *((volatile uint32_t*)(0x4006C820UL))
#define FM_I2S1_STATUS                            *((volatile uint32_t*)(0x4006C824UL))
#define FM4_I2S1_STATUS                           *((volatile uint32_t*)(0x4006C824UL))
#define FM_I2S1_DMAACT                            *((volatile uint32_t*)(0x4006C828UL))
#define FM4_I2S1_DMAACT                           *((volatile uint32_t*)(0x4006C828UL))
#define FM_I2S1_TSTREG                            *((volatile uint32_t*)(0x4006C82CUL))
#define FM4_I2S1_TSTREG                           *((volatile uint32_t*)(0x4006C82CUL))

