mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d3xg/common/s6e2d3xg.h
#define bFM_GPIO_PFR6_P0                          *((volatile  uint8_t *)(0x42DE0300UL))
#define bFM4_GPIO_PFR6_P0                         *((volatile  uint8_t *)(0x42DE0300UL))
#define bFM_GPIO_PFR6_P1                          *((volatile  uint8_t *)(0x42DE0304UL))
#define bFM4_GPIO_PFR6_P1                         *((volatile  uint8_t *)(0x42DE0304UL))
#define bFM_GPIO_PFR6_P2                          *((volatile  uint8_t *)(0x42DE0308UL))
#define bFM4_GPIO_PFR6_P2                         *((volatile  uint8_t *)(0x42DE0308UL))
#define bFM_GPIO_PFR6_P3                          *((volatile  uint8_t *)(0x42DE030CUL))
#define bFM4_GPIO_PFR6_P3                         *((volatile  uint8_t *)(0x42DE030CUL))
#define bFM_GPIO_PFR6_P4                          *((volatile  uint8_t *)(0x42DE0310UL))
#define bFM4_GPIO_PFR6_P4                         *((volatile  uint8_t *)(0x42DE0310UL))
#define bFM_GPIO_PFR6_P5                          *((volatile  uint8_t *)(0x42DE0314UL))
#define bFM4_GPIO_PFR6_P5                         *((volatile  uint8_t *)(0x42DE0314UL))
#define bFM_GPIO_PFR6_P6                          *((volatile  uint8_t *)(0x42DE0318UL))
#define bFM4_GPIO_PFR6_P6                         *((volatile  uint8_t *)(0x42DE0318UL))
#define bFM_GPIO_PFR6_P7                          *((volatile  uint8_t *)(0x42DE031CUL))
#define bFM4_GPIO_PFR6_P7                         *((volatile  uint8_t *)(0x42DE031CUL))
#define bFM_GPIO_PFR6_P8                          *((volatile  uint8_t *)(0x42DE0320UL))
#define bFM4_GPIO_PFR6_P8                         *((volatile  uint8_t *)(0x42DE0320UL))

#define bFM_GPIO_PFR7_P0                          *((volatile  uint8_t *)(0x42DE0380UL))
#define bFM4_GPIO_PFR7_P0                         *((volatile  uint8_t *)(0x42DE0380UL))
#define bFM_GPIO_PFR7_P1                          *((volatile  uint8_t *)(0x42DE0384UL))
#define bFM4_GPIO_PFR7_P1                         *((volatile  uint8_t *)(0x42DE0384UL))
#define bFM_GPIO_PFR7_P2                          *((volatile  uint8_t *)(0x42DE0388UL))
#define bFM4_GPIO_PFR7_P2                         *((volatile  uint8_t *)(0x42DE0388UL))
#define bFM_GPIO_PFR7_P3                          *((volatile  uint8_t *)(0x42DE038CUL))
#define bFM4_GPIO_PFR7_P3                         *((volatile  uint8_t *)(0x42DE038CUL))
#define bFM_GPIO_PFR7_P4                          *((volatile  uint8_t *)(0x42DE0390UL))
#define bFM4_GPIO_PFR7_P4                         *((volatile  uint8_t *)(0x42DE0390UL))
#define bFM_GPIO_PFR7_P5                          *((volatile  uint8_t *)(0x42DE0394UL))
#define bFM4_GPIO_PFR7_P5                         *((volatile  uint8_t *)(0x42DE0394UL))
#define bFM_GPIO_PFR7_P6                          *((volatile  uint8_t *)(0x42DE0398UL))
#define bFM4_GPIO_PFR7_P6                         *((volatile  uint8_t *)(0x42DE0398UL))
#define bFM_GPIO_PFR7_P7                          *((volatile  uint8_t *)(0x42DE039CUL))
#define bFM4_GPIO_PFR7_P7                         *((volatile  uint8_t *)(0x42DE039CUL))
#define bFM_GPIO_PFR7_P8                          *((volatile  uint8_t *)(0x42DE03A0UL))
#define bFM4_GPIO_PFR7_P8                         *((volatile  uint8_t *)(0x42DE03A0UL))
#define bFM_GPIO_PFR7_P9                          *((volatile  uint8_t *)(0x42DE03A4UL))
#define bFM4_GPIO_PFR7_P9                         *((volatile  uint8_t *)(0x42DE03A4UL))
#define bFM_GPIO_PFR7_PA                          *((volatile  uint8_t *)(0x42DE03A8UL))
#define bFM4_GPIO_PFR7_PA                         *((volatile  uint8_t *)(0x42DE03A8UL))
#define bFM_GPIO_PFR7_PB                          *((volatile  uint8_t *)(0x42DE03ACUL))
#define bFM4_GPIO_PFR7_PB                         *((volatile  uint8_t *)(0x42DE03ACUL))
#define bFM_GPIO_PFR7_PC                          *((volatile  uint8_t *)(0x42DE03B0UL))
#define bFM4_GPIO_PFR7_PC                         *((volatile  uint8_t *)(0x42DE03B0UL))

#define bFM_GPIO_PFR8_P0                          *((volatile  uint8_t *)(0x42DE0400UL))
#define bFM4_GPIO_PFR8_P0                         *((volatile  uint8_t *)(0x42DE0400UL))
#define bFM_GPIO_PFR8_P1                          *((volatile  uint8_t *)(0x42DE0404UL))
#define bFM4_GPIO_PFR8_P1                         *((volatile  uint8_t *)(0x42DE0404UL))

#define bFM_GPIO_PFR9_P0                          *((volatile  uint8_t *)(0x42DE0480UL))
#define bFM4_GPIO_PFR9_P0                         *((volatile  uint8_t *)(0x42DE0480UL))
#define bFM_GPIO_PFR9_P1                          *((volatile  uint8_t *)(0x42DE0484UL))
#define bFM4_GPIO_PFR9_P1                         *((volatile  uint8_t *)(0x42DE0484UL))
#define bFM_GPIO_PFR9_P2                          *((volatile  uint8_t *)(0x42DE0488UL))
#define bFM4_GPIO_PFR9_P2                         *((volatile  uint8_t *)(0x42DE0488UL))
#define bFM_GPIO_PFR9_P3                          *((volatile  uint8_t *)(0x42DE048CUL))
#define bFM4_GPIO_PFR9_P3                         *((volatile  uint8_t *)(0x42DE048CUL))
#define bFM_GPIO_PFR9_P4                          *((volatile  uint8_t *)(0x42DE0490UL))
#define bFM4_GPIO_PFR9_P4                         *((volatile  uint8_t *)(0x42DE0490UL))
#define bFM_GPIO_PFR9_P5                          *((volatile  uint8_t *)(0x42DE0494UL))
#define bFM4_GPIO_PFR9_P5                         *((volatile  uint8_t *)(0x42DE0494UL))
#define bFM_GPIO_PFR9_P6                          *((volatile  uint8_t *)(0x42DE0498UL))
#define bFM4_GPIO_PFR9_P6                         *((volatile  uint8_t *)(0x42DE0498UL))
#define bFM_GPIO_PFR9_P7                          *((volatile  uint8_t *)(0x42DE049CUL))
#define bFM4_GPIO_PFR9_P7                         *((volatile  uint8_t *)(0x42DE049CUL))

#define bFM_GPIO_PFRE_P0                          *((volatile  uint8_t *)(0x42DE0700UL))
#define bFM4_GPIO_PFRE_P0                         *((volatile  uint8_t *)(0x42DE0700UL))
#define bFM_GPIO_PFRE_P2                          *((volatile  uint8_t *)(0x42DE0708UL))
#define bFM4_GPIO_PFRE_P2                         *((volatile  uint8_t *)(0x42DE0708UL))
#define bFM_GPIO_PFRE_P3                          *((volatile  uint8_t *)(0x42DE070CUL))
#define bFM4_GPIO_PFRE_P3                         *((volatile  uint8_t *)(0x42DE070CUL))

#define bFM_GPIO_PZR0_P0                          *((volatile  uint8_t *)(0x42DEE000UL))
#define bFM4_GPIO_PZR0_P0                         *((volatile  uint8_t *)(0x42DEE000UL))
#define bFM_GPIO_PZR0_P1                          *((volatile  uint8_t *)(0x42DEE004UL))
#define bFM4_GPIO_PZR0_P1                         *((volatile  uint8_t *)(0x42DEE004UL))
#define bFM_GPIO_PZR0_P2                          *((volatile  uint8_t *)(0x42DEE008UL))
#define bFM4_GPIO_PZR0_P2                         *((volatile  uint8_t *)(0x42DEE008UL))
#define bFM_GPIO_PZR0_P3                          *((volatile  uint8_t *)(0x42DEE00CUL))
#define bFM4_GPIO_PZR0_P3                         *((volatile  uint8_t *)(0x42DEE00CUL))
#define bFM_GPIO_PZR0_P4                          *((volatile  uint8_t *)(0x42DEE010UL))
#define bFM4_GPIO_PZR0_P4                         *((volatile  uint8_t *)(0x42DEE010UL))
#define bFM_GPIO_PZR0_P5                          *((volatile  uint8_t *)(0x42DEE014UL))
#define bFM4_GPIO_PZR0_P5                         *((volatile  uint8_t *)(0x42DEE014UL))
#define bFM_GPIO_PZR0_P6                          *((volatile  uint8_t *)(0x42DEE018UL))
#define bFM4_GPIO_PZR0_P6                         *((volatile  uint8_t *)(0x42DEE018UL))
#define bFM_GPIO_PZR0_P7                          *((volatile  uint8_t *)(0x42DEE01CUL))
#define bFM4_GPIO_PZR0_P7                         *((volatile  uint8_t *)(0x42DEE01CUL))
#define bFM_GPIO_PZR0_P8                          *((volatile  uint8_t *)(0x42DEE020UL))
#define bFM4_GPIO_PZR0_P8                         *((volatile  uint8_t *)(0x42DEE020UL))
#define bFM_GPIO_PZR0_P9                          *((volatile  uint8_t *)(0x42DEE024UL))
#define bFM4_GPIO_PZR0_P9                         *((volatile  uint8_t *)(0x42DEE024UL))
#define bFM_GPIO_PZR0_PA                          *((volatile  uint8_t *)(0x42DEE028UL))
#define bFM4_GPIO_PZR0_PA                         *((volatile  uint8_t *)(0x42DEE028UL))
#define bFM_GPIO_PZR0_PB                          *((volatile  uint8_t *)(0x42DEE02CUL))
#define bFM4_GPIO_PZR0_PB                         *((volatile  uint8_t *)(0x42DEE02CUL))
#define bFM_GPIO_PZR0_PC                          *((volatile  uint8_t *)(0x42DEE030UL))
#define bFM4_GPIO_PZR0_PC                         *((volatile  uint8_t *)(0x42DEE030UL))
#define bFM_GPIO_PZR0_PD                          *((volatile  uint8_t *)(0x42DEE034UL))
#define bFM4_GPIO_PZR0_PD                         *((volatile  uint8_t *)(0x42DEE034UL))
#define bFM_GPIO_PZR0_PE                          *((volatile  uint8_t *)(0x42DEE038UL))
#define bFM4_GPIO_PZR0_PE                         *((volatile  uint8_t *)(0x42DEE038UL))

#define bFM_GPIO_PZR1_P0                          *((volatile  uint8_t *)(0x42DEE080UL))
#define bFM4_GPIO_PZR1_P0                         *((volatile  uint8_t *)(0x42DEE080UL))
#define bFM_GPIO_PZR1_P1                          *((volatile  uint8_t *)(0x42DEE084UL))
#define bFM4_GPIO_PZR1_P1                         *((volatile  uint8_t *)(0x42DEE084UL))
#define bFM_GPIO_PZR1_P2                          *((volatile  uint8_t *)(0x42DEE088UL))
#define bFM4_GPIO_PZR1_P2                         *((volatile  uint8_t *)(0x42DEE088UL))
#define bFM_GPIO_PZR1_P3                          *((volatile  uint8_t *)(0x42DEE08CUL))
#define bFM4_GPIO_PZR1_P3                         *((volatile  uint8_t *)(0x42DEE08CUL))
#define bFM_GPIO_PZR1_P4                          *((volatile  uint8_t *)(0x42DEE090UL))
#define bFM4_GPIO_PZR1_P4                         *((volatile  uint8_t *)(0x42DEE090UL))
#define bFM_GPIO_PZR1_P5                          *((volatile  uint8_t *)(0x42DEE094UL))
#define bFM4_GPIO_PZR1_P5                         *((volatile  uint8_t *)(0x42DEE094UL))
#define bFM_GPIO_PZR1_P6                          *((volatile  uint8_t *)(0x42DEE098UL))
#define bFM4_GPIO_PZR1_P6                         *((volatile  uint8_t *)(0x42DEE098UL))
#define bFM_GPIO_PZR1_P7                          *((volatile  uint8_t *)(0x42DEE09CUL))
#define bFM4_GPIO_PZR1_P7                         *((volatile  uint8_t *)(0x42DEE09CUL))
#define bFM_GPIO_PZR1_P8                          *((volatile  uint8_t *)(0x42DEE0A0UL))
#define bFM4_GPIO_PZR1_P8                         *((volatile  uint8_t *)(0x42DEE0A0UL))
#define bFM_GPIO_PZR1_P9                          *((volatile  uint8_t *)(0x42DEE0A4UL))
#define bFM4_GPIO_PZR1_P9                         *((volatile  uint8_t *)(0x42DEE0A4UL))
#define bFM_GPIO_PZR1_PA                          *((volatile  uint8_t *)(0x42DEE0A8UL))
#define bFM4_GPIO_PZR1_PA                         *((volatile  uint8_t *)(0x42DEE0A8UL))
#define bFM_GPIO_PZR1_PB                          *((volatile  uint8_t *)(0x42DEE0ACUL))
#define bFM4_GPIO_PZR1_PB                         *((volatile  uint8_t *)(0x42DEE0ACUL))
#define bFM_GPIO_PZR1_PC                          *((volatile  uint8_t *)(0x42DEE0B0UL))
#define bFM4_GPIO_PZR1_PC                         *((volatile  uint8_t *)(0x42DEE0B0UL))
#define bFM_GPIO_PZR1_PD                          *((volatile  uint8_t *)(0x42DEE0B4UL))
#define bFM4_GPIO_PZR1_PD                         *((volatile  uint8_t *)(0x42DEE0B4UL))
#define bFM_GPIO_PZR1_PE                          *((volatile  uint8_t *)(0x42DEE0B8UL))
#define bFM4_GPIO_PZR1_PE                         *((volatile  uint8_t *)(0x42DEE0B8UL))
#define bFM_GPIO_PZR1_PF                          *((volatile  uint8_t *)(0x42DEE0BCUL))
#define bFM4_GPIO_PZR1_PF                         *((volatile  uint8_t *)(0x42DEE0BCUL))

#define bFM_GPIO_PZR2_P0                          *((volatile  uint8_t *)(0x42DEE100UL))
#define bFM4_GPIO_PZR2_P0                         *((volatile  uint8_t *)(0x42DEE100UL))
#define bFM_GPIO_PZR2_P1                          *((volatile  uint8_t *)(0x42DEE104UL))
#define bFM4_GPIO_PZR2_P1                         *((volatile  uint8_t *)(0x42DEE104UL))
#define bFM_GPIO_PZR2_P2                          *((volatile  uint8_t *)(0x42DEE108UL))
#define bFM4_GPIO_PZR2_P2                         *((volatile  uint8_t *)(0x42DEE108UL))
#define bFM_GPIO_PZR2_P3                          *((volatile  uint8_t *)(0x42DEE10CUL))
#define bFM4_GPIO_PZR2_P3                         *((volatile  uint8_t *)(0x42DEE10CUL))
#define bFM_GPIO_PZR2_P4                          *((volatile  uint8_t *)(0x42DEE110UL))
#define bFM4_GPIO_PZR2_P4                         *((volatile  uint8_t *)(0x42DEE110UL))
#define bFM_GPIO_PZR2_P5                          *((volatile  uint8_t *)(0x42DEE114UL))
#define bFM4_GPIO_PZR2_P5                         *((volatile  uint8_t *)(0x42DEE114UL))
#define bFM_GPIO_PZR2_P6                          *((volatile  uint8_t *)(0x42DEE118UL))
#define bFM4_GPIO_PZR2_P6                         *((volatile  uint8_t *)(0x42DEE118UL))
#define bFM_GPIO_PZR2_P7                          *((volatile  uint8_t *)(0x42DEE11CUL))
#define bFM4_GPIO_PZR2_P7                         *((volatile  uint8_t *)(0x42DEE11CUL))

#define bFM_GPIO_PZR3_P3                          *((volatile  uint8_t *)(0x42DEE18CUL))
#define bFM4_GPIO_PZR3_P3                         *((volatile  uint8_t *)(0x42DEE18CUL))
#define bFM_GPIO_PZR3_P4                          *((volatile  uint8_t *)(0x42DEE190UL))
#define bFM4_GPIO_PZR3_P4                         *((volatile  uint8_t *)(0x42DEE190UL))
#define bFM_GPIO_PZR3_P5                          *((volatile  uint8_t *)(0x42DEE194UL))
#define bFM4_GPIO_PZR3_P5                         *((volatile  uint8_t *)(0x42DEE194UL))
#define bFM_GPIO_PZR3_P6                          *((volatile  uint8_t *)(0x42DEE198UL))
#define bFM4_GPIO_PZR3_P6                         *((volatile  uint8_t *)(0x42DEE198UL))
#define bFM_GPIO_PZR3_P7                          *((volatile  uint8_t *)(0x42DEE19CUL))
#define bFM4_GPIO_PZR3_P7                         *((volatile  uint8_t *)(0x42DEE19CUL))
#define bFM_GPIO_PZR3_P8                          *((volatile  uint8_t *)(0x42DEE1A0UL))
#define bFM4_GPIO_PZR3_P8                         *((volatile  uint8_t *)(0x42DEE1A0UL))
#define bFM_GPIO_PZR3_P9                          *((volatile  uint8_t *)(0x42DEE1A4UL))
#define bFM4_GPIO_PZR3_P9                         *((volatile  uint8_t *)(0x42DEE1A4UL))
#define bFM_GPIO_PZR3_PA                          *((volatile  uint8_t *)(0x42DEE1A8UL))
#define bFM4_GPIO_PZR3_PA                         *((volatile  uint8_t *)(0x42DEE1A8UL))
#define bFM_GPIO_PZR3_PB                          *((volatile  uint8_t *)(0x42DEE1ACUL))
#define bFM4_GPIO_PZR3_PB                         *((volatile  uint8_t *)(0x42DEE1ACUL))
#define bFM_GPIO_PZR3_PC                          *((volatile  uint8_t *)(0x42DEE1B0UL))
#define bFM4_GPIO_PZR3_PC                         *((volatile  uint8_t *)(0x42DEE1B0UL))
#define bFM_GPIO_PZR3_PD                          *((volatile  uint8_t *)(0x42DEE1B4UL))
#define bFM4_GPIO_PZR3_PD                         *((volatile  uint8_t *)(0x42DEE1B4UL))
#define bFM_GPIO_PZR3_PE                          *((volatile  uint8_t *)(0x42DEE1B8UL))
#define bFM4_GPIO_PZR3_PE                         *((volatile  uint8_t *)(0x42DEE1B8UL))
#define bFM_GPIO_PZR3_PF                          *((volatile  uint8_t *)(0x42DEE1BCUL))
#define bFM4_GPIO_PZR3_PF                         *((volatile  uint8_t *)(0x42DEE1BCUL))

#define bFM_GPIO_PZR4_P6                          *((volatile  uint8_t *)(0x42DEE218UL))
#define bFM4_GPIO_PZR4_P6                         *((volatile  uint8_t *)(0x42DEE218UL))
#define bFM_GPIO_PZR4_P7                          *((volatile  uint8_t *)(0x42DEE21CUL))
#define bFM4_GPIO_PZR4_P7                         *((volatile  uint8_t *)(0x42DEE21CUL))
#define bFM_GPIO_PZR4_P8                          *((volatile  uint8_t *)(0x42DEE220UL))
#define bFM4_GPIO_PZR4_P8                         *((volatile  uint8_t *)(0x42DEE220UL))
#define bFM_GPIO_PZR4_P9                          *((volatile  uint8_t *)(0x42DEE224UL))
#define bFM4_GPIO_PZR4_P9                         *((volatile  uint8_t *)(0x42DEE224UL))

#define bFM_GPIO_PZR5_P0                          *((volatile  uint8_t *)(0x42DEE280UL))
#define bFM4_GPIO_PZR5_P0                         *((volatile  uint8_t *)(0x42DEE280UL))
#define bFM_GPIO_PZR5_P1                          *((volatile  uint8_t *)(0x42DEE284UL))
#define bFM4_GPIO_PZR5_P1                         *((volatile  uint8_t *)(0x42DEE284UL))
#define bFM_GPIO_PZR5_P2                          *((volatile  uint8_t *)(0x42DEE288UL))
#define bFM4_GPIO_PZR5_P2                         *((volatile  uint8_t *)(0x42DEE288UL))
#define bFM_GPIO_PZR5_P3                          *((volatile  uint8_t *)(0x42DEE28CUL))
#define bFM4_GPIO_PZR5_P3                         *((volatile  uint8_t *)(0x42DEE28CUL))
#define bFM_GPIO_PZR5_P4                          *((volatile  uint8_t *)(0x42DEE290UL))
#define bFM4_GPIO_PZR5_P4                         *((volatile  uint8_t *)(0x42DEE290UL))
#define bFM_GPIO_PZR5_P5                          *((volatile  uint8_t *)(0x42DEE294UL))
#define bFM4_GPIO_PZR5_P5                         *((volatile  uint8_t *)(0x42DEE294UL))
#define bFM_GPIO_PZR5_P6                          *((volatile  uint8_t *)(0x42DEE298UL))
#define bFM4_GPIO_PZR5_P6                         *((volatile  uint8_t *)(0x42DEE298UL))

#define bFM_GPIO_PZR6_P0                          *((volatile  uint8_t *)(0x42DEE300UL))
#define bFM4_GPIO_PZR6_P0                         *((volatile  uint8_t *)(0x42DEE300UL))
#define bFM_GPIO_PZR6_P1                          *((volatile  uint8_t *)(0x42DEE304UL))
#define bFM4_GPIO_PZR6_P1                         *((volatile  uint8_t *)(0x42DEE304UL))
#define bFM_GPIO_PZR6_P2                          *((volatile  uint8_t *)(0x42DEE308UL))
#define bFM4_GPIO_PZR6_P2                         *((volatile  uint8_t *)(0x42DEE308UL))
#define bFM_GPIO_PZR6_P3                          *((volatile  uint8_t *)(0x42DEE30CUL))
#define bFM4_GPIO_PZR6_P3                         *((volatile  uint8_t *)(0x42DEE30CUL))
#define bFM_GPIO_PZR6_P4                          *((volatile  uint8_t *)(0x42DEE310UL))
#define bFM4_GPIO_PZR6_P4                         *((volatile  uint8_t *)(0x42DEE310UL))
#define bFM_GPIO_PZR6_P5                          *((volatile  uint8_t *)(0x42DEE314UL))
#define bFM4_GPIO_PZR6_P5                         *((volatile  uint8_t *)(0x42DEE314UL))
#define bFM_GPIO_PZR6_P6                          *((volatile  uint8_t *)(0x42DEE318UL))
#define bFM4_GPIO_PZR6_P6                         *((volatile  uint8_t *)(0x42DEE318UL))
#define bFM_GPIO_PZR6_P7                          *((volatile  uint8_t *)(0x42DEE31CUL))
#define bFM4_GPIO_PZR6_P7                         *((volatile  uint8_t *)(0x42DEE31CUL))
#define bFM_GPIO_PZR6_P8                          *((volatile  uint8_t *)(0x42DEE320UL))
#define bFM4_GPIO_PZR6_P8                         *((volatile  uint8_t *)(0x42DEE320UL))

#define bFM_GPIO_PZR7_P0                          *((volatile  uint8_t *)(0x42DEE380UL))
#define bFM4_GPIO_PZR7_P0                         *((volatile  uint8_t *)(0x42DEE380UL))
#define bFM_GPIO_PZR7_P1                          *((volatile  uint8_t *)(0x42DEE384UL))
#define bFM4_GPIO_PZR7_P1                         *((volatile  uint8_t *)(0x42DEE384UL))
#define bFM_GPIO_PZR7_P2                          *((volatile  uint8_t *)(0x42DEE388UL))
#define bFM4_GPIO_PZR7_P2                         *((volatile  uint8_t *)(0x42DEE388UL))
#define bFM_GPIO_PZR7_P3                          *((volatile  uint8_t *)(0x42DEE38CUL))
#define bFM4_GPIO_PZR7_P3                         *((volatile  uint8_t *)(0x42DEE38CUL))
#define bFM_GPIO_PZR7_P4                          *((volatile  uint8_t *)(0x42DEE390UL))
#define bFM4_GPIO_PZR7_P4                         *((volatile  uint8_t *)(0x42DEE390UL))
#define bFM_GPIO_PZR7_P5                          *((volatile  uint8_t *)(0x42DEE394UL))
#define bFM4_GPIO_PZR7_P5                         *((volatile  uint8_t *)(0x42DEE394UL))
#define bFM_GPIO_PZR7_P6                          *((volatile  uint8_t *)(0x42DEE398UL))
#define bFM4_GPIO_PZR7_P6                         *((volatile  uint8_t *)(0x42DEE398UL))
#define bFM_GPIO_PZR7_P7                          *((volatile  uint8_t *)(0x42DEE39CUL))
#define bFM4_GPIO_PZR7_P7                         *((volatile  uint8_t *)(0x42DEE39CUL))
#define bFM_GPIO_PZR7_P8                          *((volatile  uint8_t *)(0x42DEE3A0UL))
#define bFM4_GPIO_PZR7_P8                         *((volatile  uint8_t *)(0x42DEE3A0UL))
#define bFM_GPIO_PZR7_P9                          *((volatile  uint8_t *)(0x42DEE3A4UL))
#define bFM4_GPIO_PZR7_P9                         *((volatile  uint8_t *)(0x42DEE3A4UL))
#define bFM_GPIO_PZR7_PA                          *((volatile  uint8_t *)(0x42DEE3A8UL))
#define bFM4_GPIO_PZR7_PA                         *((volatile  uint8_t *)(0x42DEE3A8UL))
#define bFM_GPIO_PZR7_PB                          *((volatile  uint8_t *)(0x42DEE3ACUL))
#define bFM4_GPIO_PZR7_PB                         *((volatile  uint8_t *)(0x42DEE3ACUL))
#define bFM_GPIO_PZR7_PC                          *((volatile  uint8_t *)(0x42DEE3B0UL))
#define bFM4_GPIO_PZR7_PC                         *((volatile  uint8_t *)(0x42DEE3B0UL))

