mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d3xg/common/s6e2d3xg.h
#define bFM_INTREQ_IRQ114MON_USB_INT0             *((volatile  uint8_t *)(0x42627980UL))
#define bFM4_INTREQ_IRQ114MON_USB_INT0            *((volatile  uint8_t *)(0x42627980UL))
#define bFM_INTREQ_IRQ114MON_USB_INT1             *((volatile  uint8_t *)(0x42627984UL))
#define bFM4_INTREQ_IRQ114MON_USB_INT1            *((volatile  uint8_t *)(0x42627984UL))
#define bFM_INTREQ_IRQ114MON_USB_INT2             *((volatile  uint8_t *)(0x42627988UL))
#define bFM4_INTREQ_IRQ114MON_USB_INT2            *((volatile  uint8_t *)(0x42627988UL))
#define bFM_INTREQ_IRQ114MON_USB_INT3             *((volatile  uint8_t *)(0x4262798CUL))
#define bFM4_INTREQ_IRQ114MON_USB_INT3            *((volatile  uint8_t *)(0x4262798CUL))
#define bFM_INTREQ_IRQ114MON_USB_INT4             *((volatile  uint8_t *)(0x42627990UL))
#define bFM4_INTREQ_IRQ114MON_USB_INT4            *((volatile  uint8_t *)(0x42627990UL))
#define bFM_INTREQ_IRQ114MON_USB_INT5             *((volatile  uint8_t *)(0x42627994UL))
#define bFM4_INTREQ_IRQ114MON_USB_INT5            *((volatile  uint8_t *)(0x42627994UL))
#define bFM_INTREQ_IRQ114MON_RCEC1INT             *((volatile  uint8_t *)(0x42627998UL))
#define bFM4_INTREQ_IRQ114MON_RCEC1INT            *((volatile  uint8_t *)(0x42627998UL))

#define bFM_INTREQ_IRQ115MON_HSSPIINT0            *((volatile  uint8_t *)(0x42627A00UL))
#define bFM4_INTREQ_IRQ115MON_HSSPIINT0           *((volatile  uint8_t *)(0x42627A00UL))
#define bFM_INTREQ_IRQ115MON_HSSPIINT1            *((volatile  uint8_t *)(0x42627A04UL))
#define bFM4_INTREQ_IRQ115MON_HSSPIINT1           *((volatile  uint8_t *)(0x42627A04UL))
#define bFM_INTREQ_IRQ115MON_HSSPIINT2            *((volatile  uint8_t *)(0x42627A08UL))
#define bFM4_INTREQ_IRQ115MON_HSSPIINT2           *((volatile  uint8_t *)(0x42627A08UL))

#define bFM_INTREQ_IRQ117MON_I2SINT               *((volatile  uint8_t *)(0x42627B00UL))
#define bFM4_INTREQ_IRQ117MON_I2SINT              *((volatile  uint8_t *)(0x42627B00UL))
#define bFM_INTREQ_IRQ117MON_PCRC                 *((volatile  uint8_t *)(0x42627B04UL))
#define bFM4_INTREQ_IRQ117MON_PCRC                *((volatile  uint8_t *)(0x42627B04UL))
#define bFM_INTREQ_IRQ117MON_I2S1INT              *((volatile  uint8_t *)(0x42627B08UL))
#define bFM4_INTREQ_IRQ117MON_I2S1INT             *((volatile  uint8_t *)(0x42627B08UL))

#define bFM_INTREQ_IRQ118MON_SDINT0               *((volatile  uint8_t *)(0x42627B80UL))
#define bFM4_INTREQ_IRQ118MON_SDINT0              *((volatile  uint8_t *)(0x42627B80UL))
#define bFM_INTREQ_IRQ118MON_SDINT1               *((volatile  uint8_t *)(0x42627B84UL))
#define bFM4_INTREQ_IRQ118MON_SDINT1              *((volatile  uint8_t *)(0x42627B84UL))

#define bFM_INTREQ_IRQ119MON_FLINT                *((volatile  uint8_t *)(0x42627C00UL))
#define bFM4_INTREQ_IRQ119MON_FLINT               *((volatile  uint8_t *)(0x42627C00UL))

#define bFM_INTREQ_IRQ120MON_MFSINT12_RX          *((volatile  uint8_t *)(0x42627C80UL))
#define bFM4_INTREQ_IRQ120MON_MFSINT12_RX         *((volatile  uint8_t *)(0x42627C80UL))
#define bFM_INTREQ_IRQ120MON_GDCINT               *((volatile  uint8_t *)(0x42627CA0UL))
#define bFM4_INTREQ_IRQ120MON_GDCINT              *((volatile  uint8_t *)(0x42627CA0UL))

#define bFM_INTREQ_IRQ121MON_MFSINT12_TX          *((volatile  uint8_t *)(0x42627D00UL))
#define bFM4_INTREQ_IRQ121MON_MFSINT12_TX         *((volatile  uint8_t *)(0x42627D00UL))
#define bFM_INTREQ_IRQ121MON_MFSINT12_STATUS      *((volatile  uint8_t *)(0x42627D04UL))
#define bFM4_INTREQ_IRQ121MON_MFSINT12_STATUS     *((volatile  uint8_t *)(0x42627D04UL))
#define bFM_INTREQ_IRQ121MON_GDCINT               *((volatile  uint8_t *)(0x42627D20UL))
#define bFM4_INTREQ_IRQ121MON_GDCINT              *((volatile  uint8_t *)(0x42627D20UL))

#define bFM_INTREQ_IRQ122MON_MFSINT13_RX          *((volatile  uint8_t *)(0x42627D80UL))
#define bFM4_INTREQ_IRQ122MON_MFSINT13_RX         *((volatile  uint8_t *)(0x42627D80UL))
#define bFM_INTREQ_IRQ122MON_GDCINT               *((volatile  uint8_t *)(0x42627DA0UL))
#define bFM4_INTREQ_IRQ122MON_GDCINT              *((volatile  uint8_t *)(0x42627DA0UL))

#define bFM_INTREQ_IRQ123MON_MFSINT13_TX          *((volatile  uint8_t *)(0x42627E00UL))
#define bFM4_INTREQ_IRQ123MON_MFSINT13_TX         *((volatile  uint8_t *)(0x42627E00UL))
#define bFM_INTREQ_IRQ123MON_MFSINT13_STATUS      *((volatile  uint8_t *)(0x42627E04UL))
#define bFM4_INTREQ_IRQ123MON_MFSINT13_STATUS     *((volatile  uint8_t *)(0x42627E04UL))
#define bFM_INTREQ_IRQ123MON_GDCINT               *((volatile  uint8_t *)(0x42627E20UL))
#define bFM4_INTREQ_IRQ123MON_GDCINT              *((volatile  uint8_t *)(0x42627E20UL))

#define bFM_INTREQ_IRQ124MON_MFSINT14_RX          *((volatile  uint8_t *)(0x42627E80UL))
#define bFM4_INTREQ_IRQ124MON_MFSINT14_RX         *((volatile  uint8_t *)(0x42627E80UL))

#define bFM_INTREQ_IRQ125MON_MFSINT14_TX          *((volatile  uint8_t *)(0x42627F00UL))
#define bFM4_INTREQ_IRQ125MON_MFSINT14_TX         *((volatile  uint8_t *)(0x42627F00UL))
#define bFM_INTREQ_IRQ125MON_MFSINT14_STATUS      *((volatile  uint8_t *)(0x42627F04UL))
#define bFM4_INTREQ_IRQ125MON_MFSINT14_STATUS     *((volatile  uint8_t *)(0x42627F04UL))

#define bFM_INTREQ_IRQ126MON_MFSINT15_RX          *((volatile  uint8_t *)(0x42627F80UL))
#define bFM4_INTREQ_IRQ126MON_MFSINT15_RX         *((volatile  uint8_t *)(0x42627F80UL))

#define bFM_INTREQ_IRQ127MON_MFSINT15_TX          *((volatile  uint8_t *)(0x42628000UL))
#define bFM4_INTREQ_IRQ127MON_MFSINT15_TX         *((volatile  uint8_t *)(0x42628000UL))
#define bFM_INTREQ_IRQ127MON_MFSINT15_STATUS      *((volatile  uint8_t *)(0x42628004UL))
#define bFM4_INTREQ_IRQ127MON_MFSINT15_STATUS     *((volatile  uint8_t *)(0x42628004UL))

#define bFM_INTREQ_ODDPKS_ODDPKS0                 *((volatile  uint8_t *)(0x42620200UL))
#define bFM4_INTREQ_ODDPKS_ODDPKS0                *((volatile  uint8_t *)(0x42620200UL))
#define bFM_INTREQ_ODDPKS_ODDPKS1                 *((volatile  uint8_t *)(0x42620204UL))
#define bFM4_INTREQ_ODDPKS_ODDPKS1                *((volatile  uint8_t *)(0x42620204UL))
#define bFM_INTREQ_ODDPKS_ODDPKS2                 *((volatile  uint8_t *)(0x42620208UL))
#define bFM4_INTREQ_ODDPKS_ODDPKS2                *((volatile  uint8_t *)(0x42620208UL))
#define bFM_INTREQ_ODDPKS_ODDPKS3                 *((volatile  uint8_t *)(0x4262020CUL))
#define bFM4_INTREQ_ODDPKS_ODDPKS3                *((volatile  uint8_t *)(0x4262020CUL))
#define bFM_INTREQ_ODDPKS_ODDPKS4                 *((volatile  uint8_t *)(0x42620210UL))
#define bFM4_INTREQ_ODDPKS_ODDPKS4                *((volatile  uint8_t *)(0x42620210UL))

#define bFM_INTREQ_ODDPKS1_ODDPKS10               *((volatile  uint8_t *)(0x42620280UL))
#define bFM4_INTREQ_ODDPKS1_ODDPKS10              *((volatile  uint8_t *)(0x42620280UL))
#define bFM_INTREQ_ODDPKS1_ODDPKS11               *((volatile  uint8_t *)(0x42620284UL))
#define bFM4_INTREQ_ODDPKS1_ODDPKS11              *((volatile  uint8_t *)(0x42620284UL))
#define bFM_INTREQ_ODDPKS1_ODDPKS12               *((volatile  uint8_t *)(0x42620288UL))
#define bFM4_INTREQ_ODDPKS1_ODDPKS12              *((volatile  uint8_t *)(0x42620288UL))
#define bFM_INTREQ_ODDPKS1_ODDPKS13               *((volatile  uint8_t *)(0x4262028CUL))
#define bFM4_INTREQ_ODDPKS1_ODDPKS13              *((volatile  uint8_t *)(0x4262028CUL))
#define bFM_INTREQ_ODDPKS1_ODDPKS14               *((volatile  uint8_t *)(0x42620290UL))
#define bFM4_INTREQ_ODDPKS1_ODDPKS14              *((volatile  uint8_t *)(0x42620290UL))


